
#pragma once

#include "main.h"

//========================================
//  マクロ定義
//========================================
#define	ROOF_X	(100.0f)						// 天井の幅
#define ROOF_Y	(670.0f)						// 天井の高さ
#define ROOF_Z	(167.0f)						// 天井のZ値（エネミーのぶつかる位置）

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitRoof(void);
void UninitRoof(void);
void UpdateRoof(void);
void DrawRoof(void);
int GetCnt();